// gcc mice.c -o mice.exe -O0 -g -mwindows -m64 -nostdlib -Wl,-e_start && ./mice.exe ; echo $?
//  cl mice.c -nologo -Oi -Zi -GS- -Gs9999999 -link -subsystem:windows -nodefaultlib -stack:0x100000,0x100000 -machine:x64 -entry:"_start" && ./mice.exe ; echo $?
// tcc mice.c -o mice.exe -O0 -g -mwindows -m64 -nostdlib && ./mice.exe ; echo $?
// xxd -C mice.exe
// objdump -d mice.exe

typedef          char      i8;
typedef unsigned char      u8;
typedef          short     i16;
typedef unsigned short     u16;
typedef          int       i32;
typedef unsigned int       u32;
typedef          long long i64;
typedef unsigned long long u64;
typedef          float     f32;
typedef          double    f64;
static inline u32 parse_based_int(char* s, u32 i, u64* num, u32 base) {
	for(*num = 0; ; i += 1) {
		     if(s[i] >= '0' && s[i] <= '9') { *num *= base; *num += s[i] - '0'; }
		else if(s[i] >= 'a' && s[i] <= 'f') { *num *= base; *num += s[i] - 'a' + 10; }
		else if(s[i] >= 'A' && s[i] <= 'F') { *num *= base; *num += s[i] - 'A' + 10; }
		else if(s[i] != '_') break;
	}
	return i;
}

#pragma function(memset)
static inline void* memset(void* dest, int val, i64 count) {
	u8* bytes = (u8*)dest;
	while(count--) *bytes++ = (u8)val;
	return dest;
}
#pragma function(memcpy)
static inline void* memcpy(void* dest, void* src, i64 n) {
	u8* destBytes = (u8*)dest;
	u8* srcBytes = (u8*)src;
	while(n--) *destBytes++ = *srcBytes++;
	return dest;
}
#pragma function(strcmp)

	GetFileAttributesExA = GetProcAddress(kernel32, "GetFileAttributesExA", LoadLibraryA);
	CreateFileA          = GetProcAddress(kernel32, "CreateFileA", LoadLibraryA);
	ReadFile             = GetProcAddress(kernel32, "ReadFile", LoadLibraryA);
	WriteFile            = GetProcAddress(kernel32, "WriteFile", LoadLibraryA);
	CloseHandle          = GetProcAddress(kernel32, "CloseHandle", LoadLibraryA);
	void* user32         = LoadLibraryA("user32.dll");
	RegisterClassA       = GetProcAddress(user32, "RegisterClassA", LoadLibraryA);
	CreateWindowExA      = GetProcAddress(user32, "CreateWindowExA", LoadLibraryA);
	PostQuitMessage      = GetProcAddress(user32, "PostQuitMessage", LoadLibraryA);
	GetMessageA          = GetProcAddress(user32, "GetMessageA", LoadLibraryA);
	PeekMessageA         = GetProcAddress(user32, "PeekMessageA", LoadLibraryA);
	TranslateMessage     = GetProcAddress(user32, "TranslateMessage", LoadLibraryA);
	DispatchMessageA     = GetProcAddress(user32, "DispatchMessageA", LoadLibraryA);
	DefWindowProcA       = GetProcAddress(user32, "DefWindowProcA", LoadLibraryA);
	GetMonitorInfoA      = GetProcAddress(user32, "GetMonitorInfoA", LoadLibraryA);
	MonitorFromPoint     = GetProcAddress(user32, "MonitorFromPoint", LoadLibraryA);
	BeginPaint           = GetProcAddress(user32, "BeginPaint", LoadLibraryA);
	EndPaint             = GetProcAddress(user32, "EndPaint", LoadLibraryA);
	GetDC                = GetProcAddress(user32, "GetDC", LoadLibraryA);
	ReleaseDC            = GetProcAddress(user32, "ReleaseDC", LoadLibraryA);
	LoadCursorA          = GetProcAddress(user32, "LoadCursorA", LoadLibraryA);
	SetCursor            = GetProcAddress(user32, "SetCursor", LoadLibraryA);
	void* gdi32          = LoadLibraryA("gdi32.dll");
	StretchDIBits        = GetProcAddress(gdi32, "StretchDIBits", LoadLibraryA);
}

//// start common_win.h ////
static inline void* mem_alloc(u64 size) {
	return VirtualAlloc(0, size, 0x2000 | 0x1000, 0x40);
}

static inline u64 file_modified_time(char* filename) {
	u32 fileInfo[9];
	if(!GetFileAttributesExA(filename, 0, &fileInfo)) return 0;
	return ((u64)fileInfo[5] << 32) | fileInfo[6];
}
static inline u64 file_size(char* filename) {
	u32 fileInfo[9];
	if(!GetFileAttributesExA(filename, 0, &fileInfo)) return 0;
	return ((u64)fileInfo[7] << 32) | fileInfo[8];
}
static inline u32 file_read(char* filename, u8* in_buffer, u32 in_size) {
	void* fin = CreateFileA(filename, 0x80000000, 0x00000001, 0, 3, 0, 0);
	if(fin == (void*)-1) return 0;
	u32 bytes_read;
	if(!ReadFile(fin, in_buffer, in_size, &bytes_read, 0)) return 0;
	CloseHandle(fin);
	return bytes_read;
}
static inline u32 file_write(char* filename, u8* out_buffer, u32 out_size) {
	void* fout = CreateFileA(filename, 0x40000000, 0, 0, 2, 0, 0);
	if(fout == (void*)-1) return 0;
	u32 bytes_written;
	if(!WriteFile(fout, out_buffer, out_size, &bytes_written, 0) || bytes_written != out_size) return 0;
	CloseHandle(fout);
	return bytes_written;
}

//// start winnt.h ////
// e_magic and e_lfanew are the only fields used today
typedef struct IMAGE_DOS_HEADER {
	u16 e_magic;    // IMAGE_DOS_SIGNATURE (aka MZ in ASCII)
	u16 e_cblp;     //0x02
	u16 e_cp;       //0x04
	u16 e_crlc;     //0x06
	u16 e_cparhdr;  //0x08
	u16 e_minalloc; //0x0A
	u16 e_maxalloc; //0x0C
	u16 e_ss;       //0x0E
	u16 e_sp;       //0x10
	u16 e_csum;     //0x12
	u16 e_ip;       //0x14
	u16 e_cs;       //0x16
	u16 e_lfarlc;   //0x18
	u16 e_ovno;     //0x1A
	u16 e_res[4];   //0x1C
	u16 e_oemid;    //0x24
	u16 e_oeminfo;  //0x26
	u16 e_res2[10]; //0x28
	u32 e_lfanew;   //0x3C address of IMAGE_NT_HEADERS64 relative to base of image
} IMAGE_DOS_HEADER;

typedef struct IMAGE_FILE_HEADER {
	u16 Machine;
	u16 NumberOfSections;
	u32 TimeDateStamp;        // UNSUED
	u32 PointerToSymbolTable; // UNSUED
	u32 NumberOfSymbols;      // UNSUED
	u16 SizeOfOptionalHeader;
	u16 Characteristics;
} IMAGE_FILE_HEADER;
typedef struct IMAGE_DATA_DIRECTORY {
	u32 VirtualAddress;
	u32 Size;
} IMAGE_DATA_DIRECTORY;
typedef struct IMAGE_OPTIONAL_HEADER64 {
	u16 Magic;
	u8 MajorLinkerVersion;          // UNSUED //0x2
	u8 MinorLinkerVersion;          // UNSUED //0x3
	u32 SizeOfCode;//0x4
	u32 SizeOfInitializedData;      // UNSUED //0x8
	u32 SizeOfUninitializedData;    // UNSUED //0xC
	u32 AddressOfEntryPoint;//0x10
	u32 BaseOfCode;                 // UNSUED//0x14
	u64 ImageBase;//0x18
	u32 SectionAlignment;//0x20
	u32 FileAlignment;//0x24
	u16 MajorOperatingSystemVersion; // UNSUED//0x28
	u16 MinorOperatingSystemVersion; // UNSUED//0x2A
	u16 MajorImageVersion;           // UNSUED//0x2C
	u16 MinorImageVersion;           // UNSUED//0x2E
	u16 MajorSubsystemVersion;//0x30
	u16 MinorSubsystemVersion;       // UNSUED//0x32
	u32 Win32VersionValue;          // UNSUED//0x34
	u32 SizeOfImage;//0x38
	u32 SizeOfHeaders;//0x3C
	u32 CheckSum;                   // UNSUED//0x40
	u16 Subsystem;//0x44
	u16 DllCharacteristics;          // UNSUED//0x46
	u64 SizeOfStackReserve;     // UNSUED//0x48
	u64 SizeOfStackCommit;//0x50
	u64 SizeOfHeapReserve;//0x58
	u64 SizeOfHeapCommit;       // UNSUED//0x60
	u32 LoaderFlags;                // UNSUED//0x68
	u32 NumberOfRvaAndSizes;        // UNSUED//0x6C
	IMAGE_DATA_DIRECTORY DataDirectory[16];//0x70
} IMAGE_OPTIONAL_HEADER64;
typedef struct IMAGE_NT_HEADERS64 {
	u32 Signature;
	IMAGE_FILE_HEADER FileHeader;
	IMAGE_OPTIONAL_HEADER64 OptionalHeader;
} IMAGE_NT_HEADERS64;

// funcAddr = functionsList[ordinalsList[indexOfNameOfFuncInNamesList]]
typedef struct IMAGE_EXPORT_DIRECTORY {
	u32 Characteristics; // UNUSED
	u32 TimeDateStamp;   // UNUSED //0x04
	u16 MajorVersion;     // UNUSED //0x08
	u16 MinorVersion;     // UNUSED //0x0A
	u32 Name; // RVA (relative virtual address) of ASCII name of DLL //0x0C
	u32 Base; // OrdinalBase (unused? see https://stackoverflow.com/a/5654463) //0x10
	u32 NumberOfFunctions; //0x14
	u32 NumberOfNames; //0x18
	u32 AddressOfFunctions; // RVA of list of functions //0x1C
	u32 AddressOfNames; // RVA of list of 32-bit RVAs of ASCII names of functions //0x20
	u32 AddressOfNameOrdinals; // RVA of list of ordinals aka indices into functions list //0x24
} IMAGE_EXPORT_DIRECTORY;
typedef struct IMAGE_SECTION_HEADER {
	u8 Name[8];
	union {
		u32 PhysicalAddress;
		u32 VirtualSize;
	} Misc;
	u32 VirtualAddress;
	u32 SizeOfRawData;
	u32 PointerToRawData;
	u32 PointerToRelocations;
	u32 PointerToLinenumbers;
	u16 NumberOfRelocations;
	u16 NumberOfLinenumbers;
	u32 Characteristics;
} IMAGE_SECTION_HEADER;
//// end winnt.h ////

typedef struct simple_pe simple_pe;
struct simple_pe {
	IMAGE_DOS_HEADER dh;
	IMAGE_NT_HEADERS64 nt;
	IMAGE_SECTION_HEADER textsect;
};

#define CODESIZE (1<<24)
simple_pe default_pe = {
	{ // IMAGE_DOS_HEADER
		0x5A4D,
		0, // UNUSED
		.e_lfanew = sizeof(IMAGE_DOS_HEADER), // e_lfanew (ptr to new header - put right after this one)
	},
